[
  {
    "id": 106515213,
    "slug": "714c161c1f1c",
    "title": "产品经理必备的5类原型部件，你知道几个？",
    "content": "<p><b>这是Kevin的第 868</b><b>篇</b><b>原创</b></p><p><b>做产品经理多年来，我最喜欢的原型工具就是axure，主要因为原型工具用的顺手就行，在没有团队强制要求下我会选择这类工具。随着时间变化，产品经理本身原型工具的选择也发生了极大的变化。</b></p><p>以前单机本地的扩展到线上协同。</p><p>合格的产品经理都应该必备一些部件库用于提升产品设计的效率。</p><p>部件库可以有下面3点优势</p><p><b>1.减少消耗时间的通用单元组件设计</b></p><p><b>2.增加需求的严密性</b></p><p><b>3，节省了产品设计这一个单环节的时间</b></p><p>简易设计并不代表产品设计是随意的，反而是输出“高质量“的产品设计。</p><p>因此用部件库就是为了提升所谓的质量</p><p>在这里我建议有5大类部件库一定要有</p><p><b>一.按钮类</b></p><p>你见到的所有产品页面都会存在按钮。</p><p>按钮通过搭配不同的文案，去提升转化率、以及增加用户情况。好的按钮设计，为用户提供舒畅的产品使用体验。同事按钮也包含了逻辑条件，比如登录注册按钮，就需要判断用户的身份信息。</p><div class=\"image-package  \">\n<div class=\"image-container\" style=\"max-width: 700px; max-height: 690px; background-color: transparent;\">\n<div class=\"image-container-fill\" style=\"padding-bottom: 63.89%;\"></div>\n<div class=\"image-view\" data-width=\"1080\" data-height=\"690\"><img data-original-src=\"//upload-images.jianshu.io/upload_images/6313421-b3002edba646c04c.png\" data-original-width=\"1080\" data-original-height=\"690\" data-original-format=\"image/png\" data-original-filesize=\"448341\" data-image-index=\"0\" style=\"cursor: zoom-in;\" class=\"\" src=\"//upload-images.jianshu.io/upload_images/6313421-b3002edba646c04c.png?imageMogr2/auto-orient/strip|imageView2/2/w/1080/format/webp\"></div>\n</div>\n<div class=\"image-caption\"></div>\n</div><p><b>▲&nbsp;&nbsp;</b><b>不同场景的按钮设计</b><b>&nbsp;</b></p><p>按钮的种类在简易设计里主要4种分类</p><p>选项按钮</p><p>下拉按钮</p><p>普通点击按钮</p><p>双击按钮</p><p>提前准备上面4类按钮，可以快速完成产品的页面原型设计</p><p><b>二.弹窗类</b></p><p>告知用户使用产品的当前状态、反馈系统信息，弹窗是最好的表达方式。</p><div class=\"image-package  \">\n<div class=\"image-container\" style=\"max-width: 700px; max-height: 509px; background-color: transparent;\">\n<div class=\"image-container-fill\" style=\"padding-bottom: 47.13%;\"></div>\n<div class=\"image-view\" data-width=\"1080\" data-height=\"509\"><img data-original-src=\"//upload-images.jianshu.io/upload_images/6313421-16aabac03a5a85da.png\" data-original-width=\"1080\" data-original-height=\"509\" data-original-format=\"image/png\" data-original-filesize=\"134442\" data-image-index=\"1\" style=\"cursor: zoom-in;\" class=\"\" src=\"//upload-images.jianshu.io/upload_images/6313421-16aabac03a5a85da.png?imageMogr2/auto-orient/strip|imageView2/2/w/1080/format/webp\"></div>\n</div>\n<div class=\"image-caption\"></div>\n</div><p>弹窗主要有4类</p><p><b>1.toast/alert</b></p><p>这类主要是展示当前期状态的提示</p><p><b>2.单选项弹窗</b></p><p>告知用户状态， 需要用户点击知晓</p><p><b>3.多选项弹窗</b></p><p>需要用户进行操作，进行强提醒。</p><p><b>4.伴随时间消失的弹窗</b></p><p>这类弹窗是有时间限制，展示出后在固定的时间后消失。主要为用户提供关键信息告知</p><p><b>三.web页面导航类</b></p><p>每一个PC产品，都会牵扯到产品页面框架。比如网站站点的导航栏，后台的页面功能框架，都可以用固定的导航栏原型设计来完成。</p><div class=\"image-package  \">\n<div class=\"image-container\" style=\"max-width: 700px; max-height: 487px; background-color: transparent;\">\n<div class=\"image-container-fill\" style=\"padding-bottom: 45.09%;\"></div>\n<div class=\"image-view\" data-width=\"1080\" data-height=\"487\"><img data-original-src=\"//upload-images.jianshu.io/upload_images/6313421-400ad505d6c799f5.png\" data-original-width=\"1080\" data-original-height=\"487\" data-original-format=\"image/png\" data-original-filesize=\"211486\" data-image-index=\"2\" style=\"cursor: zoom-in;\" class=\"\" src=\"//upload-images.jianshu.io/upload_images/6313421-400ad505d6c799f5.png?imageMogr2/auto-orient/strip|imageView2/2/w/1080/format/webp\"></div>\n</div>\n<div class=\"image-caption\"></div>\n</div><p><b>▲&nbsp;&nbsp;</b><b>web页面导航</b><b>&nbsp;</b></p><p>在web页面导航里，如果是面向C端用户的。这类框架可以实现需求的落地，但至于UI就可以放心的交给UI设计师，因为成熟的原型框架非常容易理解。</p><p>如果是面向业务内部的业务系统，则更能够让开发、业务方快速理解并知晓系统的操作，使用这种成熟的部件会让业务、开发、设计都轻松很多。</p><p>何乐而不为？</p><p><b>四.移动端列表类/瀑布流</b></p>",
    "excerpt": "做产品经理多年来，我最喜欢的原型工具就是axure，主要因为原型工具用的顺手就行，在没有团队强制要求下我会选择这类工具。随着时间变化，产品经理本身...",
    "words_count": 820,
    "views_count": 17228,
    "likes_count": 115,
    "user_id": 6313421
  },
  {
    "id": 105534308,
    "slug": "98f78a45edc1",
    "list_image_url": "https://upload.jianshu.io/users/upload_avatars/9988193/fc26c109-1ae6-4327-a298-2def343e9cd8.jpg?imageMogr2/auto-orient/strip|imageView2/1/w/360/h/240",
    "title": "不要与内心贫穷的人在一起",
    "content": "<p>一位女孩的母亲写给女儿的一封信，刷爆了朋友圈：女儿，听说你要带男朋友回家了。我跟你父亲很开心。但是上周跟他接触之后呢，我们却坚决不同意，我们知道，你们在来往，你很伤心，也很生气，哭着说我们都是为了钱，但是比起来你一生的幸福来说，妈妈还是你能够想清楚，那个男孩并非良人，因为他太穷了。他穷得不仅仅是金钱，而是精神上的匮乏，恋爱很幸福，但是生活的财米油盐里，你一定因为他的穷而吃苦。</p><p>作为现代人，当然不能太物质了。必定穷人翻身的概率太多了。</p><p>人不怕物质上的贫穷，必定人来到世上的时候，都是光溜溜的。有钱也是父母亲的，并不是你的。这方面来讲，人精神层面的富有才更重要。</p><p>婚姻的事，按理说父母不易过于干预，但父母的话也不可以不全听。他们毕竟是过来人，看人会更为透彻。婚姻是一个人一生当中的顶级大事。</p><p>与一个毫无追求的人生活一辈子，是不会有任何希望的。</p>",
    "excerpt": "一位女孩的母亲写给女儿的一封信，刷爆了朋友圈：女儿，听说你要带男朋友回家了。我跟你父亲很开心。但是上周跟他接触之后呢，我们却坚决不同意，我们知道...",
    "words_count": 367,
    "views_count": 26590,
    "likes_count": 368,
    "user_id": 301940
  },
  {
    "id": 106987603,
    "slug": "058e172a25a9",
    "list_image_url": "https://upload.jianshu.io/users/upload_avatars/3136195/484e32c3504a.jpg?imageMogr2/auto-orient/strip|imageView2/1/w/360/h/240",
    "title": "我卖了小说的有声版权",
    "content": "<p>昨天晚上十一点多了，编辑突然联系我，问我的一本小说的有声版权出售问题。</p><p>我非常开心，虽然钱不多，但是有人想买，还是有人喜欢我的作品的。</p><p>那本小说是个短篇，四万多字，是前几年写的，在爱文者发布之后只得了四十阅读币，也就是四毛钱。</p><p>就一直放着，我也没有理它。</p><p>有很久一段时间不登陆那里了，有一天偶然登录，发现小说下面留言喜马拉雅有声主播想购买。当时以为是假的。</p><p>后来抱着试试看的心情，先签了约，然后投稿卖版权。</p><p>投稿一家之后，一直处于审稿状态。心想，没戏了吧！</p><p>昨晚编辑说，有人要买，我非常高兴。简单了解一下就同意。</p><p>今天就顺利签约了。</p><p>钱已经到账了，虽然钱不多，可是好高兴啊！</p><p>原来我写的东西也可以有人喜欢，好有成就感！</p>",
    "excerpt": "昨天晚上十一点多了，编辑突然联系我，问我的一本小说的有声版权出售问题。 我非常开心，虽然钱不多，但是有人想买，还是有人喜欢我的作品的。 那本小说...",
    "words_count": 299,
    "views_count": 2626,
    "likes_count": 4,
    "user_id": 7416466
  },
  {
    "id": 105372571,
    "slug": "e2a47cd52ef2",
    "list_image_url": "",
    "title": "当年狂傲的他如今怎么样了",
    "content": "<p>他初中和女学生同居，学习中上等，模样可人，女学生心甘情愿被他睡。</p><p>高中的他和一个女同学打了一次乒乓球，女同学几十年念念不忘，每每说起就脸颊泛红。</p><p>他考上了省财经学院。</p><p>毕业几年后，他考取了某市的公务员。</p><p>他是我同学，我不喜欢他的高调，他喜欢说我就听。</p><p>他说：“你看看你，毕业几年了还不结婚，你不是胸怀大志就是极度自卑有心理或者生理缺陷。”</p><p>我笑笑，自己清楚自己不用给别人解释。</p><p>他说：“某某集团的老总家的千金，追我，某某集团那可是全国的出名大企业。”</p><p>我笑：“你真厉害。”</p><p>他眼睛看着天，继续说：“我考了某市的公务员，不想去，又考了某市的公务员。”</p><p>“你真牛！”我继续羡慕，他的高度已经不是我这类做中小学生的一线老师能达到的了。</p><p>他的妹妹是我的学生。</p><p>他的妹妹师范大学毕业成了我同事，她四处说她有很牛逼的大哥，很有钱。</p><p>别人向我求证，我说应该是。</p><p>他很牛的一件事是一个发小跟了他一周，他送了发小一辆四十多万的奥迪A6。</p><p>但是，二十多年后的今天，他没有飞黄腾达，他进了监狱。</p><p>听说网上通缉他时，他连夜背着一麻袋钱抄田间小路正逃，刚逃了几十公里就被公安局捉了。</p>",
    "excerpt": "他初中和女学生同居，学习中上等，模样可人，女学生心甘情愿被他睡。 高中的他和一个女同学打了一次乒乓球，女同学几十年念念不忘，每每说起就脸颊泛红。...",
    "views_count": 2414,
    "likes_count": 6,
    "user_id": 3343569
  },
  {
    "id": 106940964,
    "slug": "17c7c48103d9",
    "list_image_url": "https://upload.jianshu.io/users/upload_avatars/9822996/07d73544-9c76-44f2-932d-8a35935216f9.jpg?imageMogr2/auto-orient/strip|imageView2/1/w/360/h/240",
    "title": "往事",
    "content": "<p>大学毕业，我就跟一个女孩网恋，我被骗去她家广西砍甘蔗，我去她家砍了一周的甘蔗，嘴没亲过，手没牵过，我跟她还是分开两个房间睡觉，回家说给发小听还被嘲笑。</p><p>我上学的时候，一个女孩同桌可能有自闭症，坐在我旁边少说话，她不开心就划伤我的手，我问她，你不开心为什么不划伤你的手，她说我怕痛，我说我也怕痛。</p><p>人外有人， 天外有天，天下之大，无奇不有。今晚我听一个男生分享的往事，工地附近没地方玩，昼夜温差大，白天气温高，晚上气温寒冷，我只能在办公室听听趣事。</p>",
    "excerpt": "大学毕业，我就跟一个女孩网恋，我被骗去她家广西砍甘蔗，我去她家砍了一周的甘蔗，嘴没亲过，手没牵过，我跟她还是分开两个房间睡觉，回家说给发小听还被...",
    "views_count": 37,
    "likes_count": 1,
    "user_id": 4263857
  },
  {
    "id": 105410847,
    "slug": "f1b64f8f8e91",
    "list_image_url": "https://upload.jianshu.io/users/upload_avatars/2631077/dc99c361412c?imageMogr2/auto-orient/strip|imageView2/1/w/360/h/240",
    "title": "稿酬终于有眉目了",
    "content": "<p>今日收到朋友的一条消息，写完的书终于要给稿酬了，一阵高兴。将近一年半的时间，终于有了音信，我第一反应就是：这些钱，我一定要把它消费掉，有种天上掉下馅饼的感觉。</p><p>当时朋友找到我的时候，情况还挺紧急的。他们写一套丛书，老早就定下的作者跑路了，干半道没干了。找到我说，实在找不到人了，就我还算有些靠谱，让我去写一写。当时虽然已经提离职了很长时间，但工作在收尾中，也是挺忙碌的。朋友一阵蛊惑，讲主编人有多厉害，讲出版社有多好，讲会挂作者名啥的。到底没抵制住诱惑，就答应了下来。</p><p>丛书是给孩子们写导读，我写的是6年级的，不记得是七本书还是八本书，全部要看完，每本还要写不少于一万字的导读稿，还要自选角度。给我的时间，才一个半月。一来我一旦出口承诺就不会失信；二来做任何事情我都不愿意马虎了事，都会尽到自己全力。有些稿件一把通过，有些稿件修改了很多次，就是过不了，各种挣扎，最后提前完成了全部任务。</p><p>时间的紧迫，公司的工作压力，写稿阅读和写作的压力，几重压下来，我竟然没垮掉，想想自己也相当牛。不过，我那时候就发誓：坚决不通过写稿子赚钱，太痛苦了。话有得说回来，很多时候，人都是逼出来的。不逼自己一把，都不知道自己能做到什么程度。</p><p>接下来就是等待出版社出书，希望拿到样书，拿到稿酬。但等着等着，就变成了石沉大海了。中间问了一次，说是得等。好吧，那就等吧。反正也不怕人跑路了，反正也没几个钱，反正我也不靠这个钱吃饭……</p><p>当这么沉寂了一年半，今天来了个消息，还挺开心的。税后拿到了一万出头，哈哈，能吃不少美食了。快快找人推荐美食吧~</p>",
    "excerpt": "今日收到朋友的一条消息，写完的书终于要给稿酬了，一阵高兴。将近一年半的时间，终于有了音信，我第一反应就是：这些钱，我一定要把它消费掉，有种天上掉...",
    "views_count": 402,
    "likes_count": 4,
    "user_id": 14715425
  },
  {
    "id": 106121835,
    "slug": "ea1776568bb8",
    "title": "最近，微信这2条规则改了",
    "content": "<p>微信平台的规则，一直是我们产品经理们首要关注的，因为这直接影响到了自己的产品新增用户数、以及转化率。</p><p>比如曾经2018年小程序刚上线，最大的变化是微信小程序苹果端不再支持虚拟商品支付，安卓则可以。就让许多产品经理放弃了微信小程序赛道，甚至企业对招聘到的前端开发都裁掉。</p><p>最近我们在运营PMTalk中，发现了2个影响较大的规则出现了变化，如果你的产品主要面向微信用户，那这两点规则就要对应的产品设计了。</p><p><b>这两点规则，越早知道早，越早去优化。</b></p><p><b>1.微信分享的规则更改</b></p><p>2021年11月份微信链接分享做了新的优化，不允许开发者转发的时候自定义，这导致我们日常喜欢用的H5用来获客就没有机会了。</p><p><b>▲更改规则后的样式</b></p><p>用户分享第三方H5，点击朋友圈、转发好友都以链接URL的形式直接展示，而不是单独的卡片形式。我们都知道卡片分享形式的点击率在朋友圈分享比链接高，同时用户也能通过卡片知道点击的内容是什么，而URL却不知道，点击率也低。</p><p>以前有H5卡片形式，我们可以吸引用户进行转发，获客新用户。现在微信朋友圈里除了微信公众号文章外，其他的H5是不可以的。</p><p><b>这也是为什么这1年你几乎没有看到特别多的刷屏H5了，也是这个原因。</b></p><p><b>2.微信小程序登录注册接口</b></p><p>最近我们微信小程序出现了下面问题，点击微信一键登录，一直登录不成功，反复循环。</p><p>PMTalk小程序的新用户无法完成授权登录，后面查询到的原因是</p><p><b>微信小程序用户授权的接口改了</b>，现在不支持通过微信授权直接把微信头像、昵称进行提供给开发者收集，只能以”<b>微信用户“</b>的方式展示。</p><p>如果需要获取用户头像，则需要单独调用微信头像的接口，交互形式可以看见下面，在个人中心点击更换头像，可以允许获取微信头像，不再是一次性通过微信昵称授权。</p><p><b>整理了流程后可以看到，个人信息收集被拆解了2步。</b></p><p>这样的改变后，自然对于面向C端的产品开发者来说，用户信息的获取成本更高了，</p><p><b>比如有开发者提到</b></p><p>”有一个场景是用户只是进来参与活动，比如帮忙砍价、助力等，我需要知道好友给我助力了，这时候也不好让助力的人去个人中心或者给一个表单让他去填写昵称跟头像，整个流程就会变得非常长，非常重。“</p><p>所以对于在H5、小程序深耕的产品经理要注意新的规则了，这次更新会有什么影响呢？</p><p><b>1.流量获取更难</b></p><p>朋友圈显然是大家从私域流量转化的必经之地，现在不允许卡片形式分享了后，用户只能通过扫码才能访问链接，大大增加了门槛。</p><p><b>2.小程序获客成本加大</b></p><p>在微信官方下，我看到一个有意思的开发者留言：</p><p>很多正规平台我都希望直接使用“微信头像昵称”，如这条评论，这是我唯一识别自己的身份标识，你可以想象这个帖子下全是“微信用户”评论的效果，像机器人刷的。</p><p>以为这样就能解决问题？这是强行逼用户去每个小程序都要重新授权两次不是？？？？</p><p><b>3.产品经理应该怎么设计？</b></p><p><b>针对微信分享</b></p><p>现在需要提供扫码来解决，点击分享后生成海报允许用户分享海报在朋友圈来扫码进入</p><p><b>针对小程序</b></p><p>增加默认头像，对不需要头像的用户场景下提供服务，需要用户头像的引导用户进行个人中心设置。</p><p><b>同时在后台管理上增加新的监控数值字段</b></p><p>在用户管理里，加入用户头像管理字段，对用户是否已经更新头像进行记录</p><p>对企业自己的URL，增加扫码次数统计，比如以前是点击数、分项数，现在需要额外统计扫码人数和扫码成功数。</p><p><b>最后有点意思的是</b></p><p>目前微信官方的H5扫码登录仍然支持微信头像授权，不知道以后H5是否会改变？</p><p>因为H5能够获取头像了，对于开发者来说小程序不能获取也没事，毕竟数据都拿到了。</p><p>今天的分享就到这儿。</p>",
    "excerpt": "微信平台的规则，一直是我们产品经理们首要关注的，因为这直接影响到了自己的产品新增用户数、以及转化率。比如曾经2018年小程序刚上线...",
    "views_count": 97,
    "likes_count": 1,
    "user_id": 6313421
  },
  {
    "id": 106515243,
    "slug": "3a8eef89cf88",
    "title": "产品经理怎么判断要裁员了？",
    "content": "<p>裁员，这对做产品经理的同学来说，<b>真的非常常见。</b></p><p>我在下面发起了一个投票，如果你刚好是做产品或运营的同学，欢迎参与调研。</p><p>可以看到如果你做产品经理时间越久，那么经历裁员这件事的概率就越来越高。</p><p>工作5年以后，实际上我身边仍然还在做产品经理的都会遇到过裁员，有可能是因为试用期没有过关，也有是绩效长期垫底，还有的是突发谈话走人，如果你做产品经理的时间足够长，我相信你总有一天会遇到。</p><p>恰好最近有一个小伙伴找到我私聊：<b>”在公司里老师绩效成绩不好，现在听说公司要裁员不知道是否要跑了，请教下该怎么办。“</b></p><p>01.</p><p><b>怎么判断公司要裁员？</b></p><p>所以针对这个问题，我分享下自己身边的故事案例，总结出了下面几点来判断这家公司是否会裁员、以及在面对裁员怎么自救的技巧。</p><p><b>1.公司、部门的核心考核目标与你相关吗</b></p><p>对于一家公司或一个产品来说，他是有北极星指标的。这一点其实在面试的时候就可以知道，指标表明了当前公司是处于探索、增长、稳定、还是衰退周期。</p><p>我建议产品经理在面试的时候可以提问，类似：”公司是更看重营收还是看重用户月活？“如果是后者可以看公司至少现在是烧钱的。</p><p><b>如果是前者，那么说明公司是有已经雏形的商业模式或产品了。</b></p><p><b>但不管是哪一类指标，你自己的工作是否处于部门、或公司的考核目标里，如果没有，那么恭喜你可能会被裁员。</b></p><p><b>2.公司的考勤管理变化大不大？</b></p><p>在我曾经呆过的一些公司，必须要承认的是，只要是有裁员计划的企业，那么一定会逐渐对员工考勤严格，比如曾经还可以有浮动时间打卡甚至是不打卡，变成了要打卡甚至是迟到一分钟都不可以，并且将考勤作为员工绩效的指标。</p><p>如果是后者，那么就是因为公司要裁员了，通过考勤打卡来体现员工的工作时间和工作态度，从而裁掉工作态度差的员工。</p><p><b>3.整体公司的业务数据周期性下滑没？</b></p><p>如果要判断公司裁员真假与否，那这一点就比较关键了。</p><p>作为内部员工是可以看到自家产品核心业务数据和竞品数据之间的业务差距，到底是差距变得越来越大，还是越来越小？</p><p>如果是前者那么裁员的结果就是板上钉钉的事了。</p><p>发生裁员是迟早的事，可能是3个月也可是1年左右时间，数据下滑明显迟迟不上升，那么就要考虑好跑路的准备了。毕竟老板不是做公益的，就算再土豪的企业也会挥泪斩乱码，通过关停项目来及时止损。</p><p><b>4.个人的绩效成绩长期垫底了吗？</b></p><p>通常来说，裁员首先会裁掉那些绩效成绩垫底的同学。不可否认在企业里，通过招聘进来的产品经理存在因为难以胜任工作做不出成绩导致绩效垫底，但也有很多时候是因为领导的沟通、部门任务分配不合理，导致员工的季度、年度绩效成绩，一直是部门垫底的，自然这类同学就成了目标了。</p><p>所以当自己的绩效成绩已经超过10个月以上垫底，那说明固定的印象分已经形成了，那以后的绩效成绩在同一个部门也大概率你也是垫底的，所以在1年左右就及时跑路看机会，避免损失更多青春和绩效奖金。</p><p><b>5.有没有新的高管降临</b></p><p>如果说你所呆在的团队，有新的高管（VP或者CEO）空降进行管理，那么人员变动的情况也是极大概率的，毕竟换血、寻找自己熟悉的人来干活，是人的本性。</p><p>02.</p><p><b>碰到了裁员，该怎么办？</b></p><p>只要你在互联网行业，你就非常可能会面临裁员，即使你在那些大厂里面，也会因为项目孵化失败而告终。</p><p>面对裁员这件事，曾经在我的职业生涯中，一个老领导在裁员前给我说过：<b>”尽人事听天命，就好了。“</b></p><p>因此，在1个公司的运营和发展里，一个企业要想活下去就必须要换新血液，以及降本增效。一个产品经理就像一颗螺丝钉，是没有办法挽回的。</p><p>如果说裁员的结局没有办法避免，我们作为个人来说可以采取下面的方法来为自己努力一把，争取自己的利益。</p><p><b>1.去换到核心部门</b></p><p>每个公司只要还在正常运营，一定会存在核心业务部门。所以这类部门对应的用人需求、和资源配比也是最高的，同时也是相对更加稳定的。</p><p>所以在判断要出现裁员后，越早进行内部切换，是一个可有效避免裁员的方式，或者说延长自己的工作时间。</p><p>毕竟只要公司持续亏损，那么核心部门也会变得不核心。</p><p><b>2.和直属领导和上上级领导沟通</b></p><p>前面提到了，裁员的目标往往是绩效成绩在部门长期垫底的同学。绩效不好，自然是工作任务或者工作价值出了问题，所以和领导沟通看看是发生了什么问题，能不能进行修正。</p><p>比如和领导沟通换一个工作方向，如果直属领导无法解决，那就找上上级领导去表达工作上的困境，找到有需求的部门，证明自己的工作价值。</p><p>如果公司已经处在裁员的环境了，这种沟通方式其实意义也不大，因为始终要有人走的，这个时候再怎么沟通，你绩效差的事实已经无法在OA系统中抹去了。</p><p>03.</p><p><b>裁员，一定要拿赔偿</b></p><p>针对今年的寒冬，2022年仍然有非常多的互联网企业在继续裁员，身边的产品经理们都在认同，现在的互联网已经没有了红利，所以如果真的碰到裁员，也希望同学们打起精神来去维护自己的权益。</p><p>在面对裁员，一定要拿到自己应该有的赔偿，至少可以抵扣自己本身年底或季度的奖金，降低自己的损失。</p><p>毕竟很多产品经理的薪资有很大一部分是年底的年终奖，公司在裁员的时候是不留情面的，那自然对维护自己利益也要不客气，否则没有人帮你。</p><p>04.</p><p><b>裁员，也是一个新的开始</b></p><p><b>对于产品经理来说，要想涨薪或者进入大厂，跳槽相比职场晋升是最性价比的，几乎每个人都会在职业里面遇到裁员或者被试用期不通过的情况。</b></p><p>面对裁员，有的同学会非常伤心，毕竟同在一个部门里面，怎么就自己被裁了，难免会怀疑自己的能力，甚至会有人感叹命运不舛。</p><p>我个人建议这类同学仍然要善于复盘，增加对于公司、部门工作的选择判断能力，做出一些调整，避免在未来踩坑。</p><p>比如国企就是稳定了，大厂就一定可以拿高薪了，这些想法其实都是非常幼稚的，<b>毕竟国企也有倒闭的，大厂也会降薪。</b></p><p>复盘找到自己的优势和短板，才能容易找到匹配的机会，同时总结自己现阶段工作的确存在的问题，进行解决。</p><p><b>今天的分享就在这儿。</b></p>",
    "excerpt": "裁员，这对做产品经理的同学来说，真的非常常见。我在下面发起了一个投票，如果你刚好是做产品或运营的同学，欢迎参与调研...",
    "views_count": 47,
    "likes_count": 0,
    "user_id": 6313421
  },
  {
    "id": 103249172,
    "slug": "c52a35760752",
    "title": "我身边的几位产品朋友被裁了",
    "content": "<p>还记得一个电影《超脱》里，代课老师上台给学生数布置了一个作业：</p><p>“<b>如果你死了，在你的葬礼上，你的家人或朋友会说些什么</b>”</p><p>如果我们把这个问题换成：“<b>想象下，如果你被裁了，在你离开公司的最后一天，你的家人、或朋友同事会说些什么？</b>”</p><p><b>好好去思考这个问题。</b></p><p>我相信你的内心一定会<b>产生求生欲。</b></p><p>那就是寻找去降低被裁员后带来风险的事，或是你可以从被裁员的第一天开始，实际上等同于解开了工作对你的枷锁<b>，你开始迈入了一个新的高度。</b></p><p><b>但问题是，你现在能吗？</b></p><p>所以，今天这篇文章我希望你早点阅读，即使你还没有成为产品经理或者已经做了10年产品经理，希望你时刻谨<b>记今天这篇文章，来自我身边朋友的故事。</b></p><p><b>最近身边做产品、运营的朋友裁员的消息接踵袭来。</b></p><p>就在今天我和一个朋友聊到关于PMTalk合作的事情才突然告知，最近腾讯裁员，他已经归属到被毕业的团队里了。</p><p>同时另外一个我深圳的好朋友做运营专家，也是在某独角兽被裁员了</p><p>我相信这两位被裁员的同事一定最近不开心，他们的内心可能会有下面的对话。</p><p><b>“裁员是一种对我价值的否定，辛苦为企业挥洒了青春和汗水，你却让我走！留下的同事成了幸运儿，他们可能比我实力强，也可能只是运气好而已。”</b></p><p><b>“但是为什么运气差的是我？”</b></p><p><b>“下个月的房贷、车贷来了，我现在能做什么去缓冲吗？”</b></p><p><b>“互联网的红利已经没了， 我能去其他大厂吗？还是去一个小公司呢？”</b></p><p>因为在互联网行业工作，唯一的不变就是处于这种变化里。所以在互联网工作，越靠近30岁才知道一份稳定的工作会越来越成一种奢侈。</p><p><b>去大厂工作就是优秀吗？</b></p><p>这次5月、6月的裁员潮，不仅是从腾讯这些大厂，还有一些腾讯系、阿里系相关的独角兽公司，裁员的人集中在一些边缘部门或者创新的部门。</p><p>我们从学校读书，到毕业找工作，所有的一切都在教我们成为自己行业最优秀的人，但是什么是优秀呢？</p><p><b>能赚钱的是优秀?</b></p><p><b>还是权利最大的的是优秀?</b></p><p><b>还是最出名的是优秀?</b></p><p><b>希望你自己思考下这个问题的答案。</b></p><p><b>听老人说，总是没有错</b></p><p>在经历校园到社会的工作选择时，父母或长辈们一定让你去事业单位、或者去公务员，因为他们认为稳定，这才是最重要的，现在看来这些建议并不是错误的。</p><p>即使他们已经在时代落后了，但是至少会给你一个比较不差的选择。我们不希望自己被房贷、车贷压垮，就算工作做的不好仍然<b>有机会翻盘。</b></p><p><b>翻盘指的是就是这个月的绩效工资可以差一些</b>，但是大不了下个月再来。今年钱到手少一些，我可以明年再来，只要我在这里，我就可以有机会再努力一次，可以裁员则等于抹杀了这个希望。</p><p>我还记得当初大学毕业的时候父母希望我学医，我没有听取他们的建议，因为我希望能够去创业，所以选择了做产品经理。</p><p>相比你再大城市打拼，很可能连房子都买不起，但是有一份稳定的工作后，至少可以让你很愉快的找到女朋友或男朋友，成立一个家庭。</p><p>我常常告诉我的学生，当你选择做产品经理的时候，你要首先思考你想成为一个什么样的人？</p><p><b>一个能够改变世界的人？还是希望一份高薪收入，还是只是希望一份体面的工作？</b></p><p>如果没有一丝毫的想去改变世界的梦想或者愿景，我不建议你做产品经理，即使你做了你也做不长久，因为产品经理这个工作真的需要有情怀才能长久的驱动，<b>即使遇到了一个让你吐血的老板。</b></p><p><b>裁员让这些人离开了大厂，那么他们会做什么呢？</b></p><p>我了解到的很多人，因为都是多年的技术经验，所以从自己的专业度入手，从自媒体以知识传播的形式开始做分享、甚至是咨询，去获得副业收入。</p><p>我之前写过产品经理可以做的副业，可以参考这篇文章。</p><p><b><a href=\"https://links.jianshu.com/go?to=http%3A%2F%2Fmp.weixin.qq.com%2Fs%3F__biz%3DMzIyODYwMjY2OQ%3D%3D%26mid%3D2247512122%26idx%3D1%26sn%3D9d3b0c7877cee8826553e8ef2f3393ec%26chksm%3De84d9678df3a1f6e7f4299cf3fb887785d7cd3bfad1823317a1ed23423fdc3b9c27f39c4c28d%26scene%3D21%23wechat_redirect\" target=\"_blank\">产品经理可以做的副业有什么？</a></b></p><p>选择以技能谋生的副业，这当然是一个非常不错的方式。唯一错的是在进入大厂的第一天就应该提前做，而不是在打算离开的时候再决定。</p><p><b>城市的资源是不是你的资源？</b></p><p>我身边有一个成都的朋友，给她年薪100万都不愿意离开成都</p><p><b>“不管给我多少钱的工资，都不愿意离开这里”</b></p><p>这是我最近在成都认识一个做探店的网红博主告诉我的。</p><p>成都对于她来说不仅是家乡，也是一种生活方式，她喜欢在工作之余进行探店这种副业的生活。平时做视频剪辑运营的她，可能6点下班就可以去接点外快单，然后做自己喜欢的工作，然后再回家和爸妈一起聊聊天睡觉。</p><p><b>你说这是懒惰吗？有人会认为是，因为她不愿意离开成都</b></p><p>但是你也可以说不算，因为他在工作之外还在利用自己周末、下班等所有时间去完成一个拍摄的商务洽谈、拍摄、视频剪辑等工作，用她的话说：<b>“这是做自己喜欢的事情去顺便赚个钱罢了”</b></p><p>2019年我选择带着团队回成都来，不仅是因成都是我的家乡，还有一个重要原因是我认<b>为在成都才有更多的可能。</b></p><p>相比一线城市繁重的实体成本，成都可以在这里接触到其他行业和更多的圈子和机会。</p><p>所以城市的资源能不能变成你的资源，是我们被裁员后需要思考问题的关键，虽然我们拿着大厂的高薪。</p><p>但是我们天天在冰冷的写字楼里，身边只有技术、研发同学，但是却少了融入进我们衣食住行的元素，比如餐饮、比如穿搭、比如旅游等等，这些们都因工作的原因拘束了我们。</p><p>当我们在选择那些高收入、感觉体面的工作，<b>就要看看我们的时间是否已经被挤走了，还是要死磕产品经理、运营这条职业经理人路线。</b></p><p><b>产品经理的压力来自于生活的压力</b></p><p>35岁的产品经理难的并不是赚不到钱，而是因刚性物质需求，被迫感受到压力。</p><p>有一句话说得好，<b>从好的优质环境下降到更差的生活物质是比较困难的，但是变成更好的，确实非常让人愿意接受的。</b></p><p>还记得刚开始做公众号的时候， 我一直以为公众号有个10000读者就满足了，凭着一些零碎的广告收入和培训，就老老实实把学生教好，客户服务好，可以把自己养活就足够了，不去折腾创业和工作了，既忙碌又累。</p><p>可是当你进入了30+，有了自己的家，你就发现曾经的愿景统统不能实现，<b>比如我身边很多在一线城市工作的产品经理们，为了在一线城市定居，房贷都是200-400万左右。一个月从1万到2万多的房贷，要还款30年之久。</b></p><p>可以参与下面投票看看你的房贷</p><p>那就不能说一份随意的自由职业可以cover以上的成本了。</p><p><b>给生活换一个方式</b></p><p>所以我身边的朋友偶尔会给我说，是不是应该给自己换一个活法，卖掉一线城市的房子，把贷款还了，拿着剩余的现金去小城市买个洋房或独栋别墅，然后再其他资金存银行就这样找个喜欢的事情，开个超市、或者开个剪发店就这样过了？</p><p>我记得我母亲曾经告诉我一句话，说：“钱是赚不完的，生活要有家庭才是幸福”，或许这对我们在裁员的当天可以好好品位这句话，给自己换一个方式。</p><p>今天的分享就在这，希望能够帮助你减轻现在互联网路上的焦虑，从现在开始吧！</p>",
    "excerpt": "还记得一个电影《超脱》里，代课老师上台给学生数布置了一个作业：如果你死了，在你的葬礼上，你的家人或朋友会说些什么...",
    "views_count": 377,
    "likes_count": 12,
    "user_id": 6313421
  }
]
